{
  "template_to_id": {
    "<*> L3 <*> error(s) (dcr <*>) detected and corrected": 0,
    "<*> L3 <*> error(s) (dcr <*>) detected and corrected over <*> seconds": 1,
    "<*> ddr error(s) detected and corrected on rank <*>, symbol <*> over <*> seconds": 2,
    "<*> ddr errors(s) detected and corrected on rank <*>, symbol <*> bit <*>": 3,
    "<*> double-hummer alignment exceptions": 4,
    "<*> floating point alignment exceptions": 5,
    "<*> microseconds spent in the rbs signal handler during <*> calls. <*> microseconds was the maximum time for a single instance of a correctable ddr.": 6,
    "<*> torus non-crc error(s) (dcr <*>) detected and corrected": 7,
    "<*> torus non-crc error(s) (dcr <*>) detected and corrected over <*> seconds": 8,
    "<*> torus processor sram injection error(s) (dcr <*>) detected and corrected over <*> seconds": 9,
    "<*> torus processor sram reception error(s) (dcr <*>) detected and corrected": 10,
    "<*> torus receiver <*> input pipe error(s) (dcr <*>) detected and corrected": 11,
    "<*> torus receiver <*> input pipe error(s) (dcr <*>) detected and corrected over <*> seconds": 12,
    "<*> torus receiver sram ecc error(s) (dcr <*>) detected and corrected": 13,
    "<*> torus receiver sram ecc error(s) (dcr <*>) detected and corrected over <*> seconds": 14,
    "<*> torus sender <*> retransmission error(s) (dcr <*>) detected and corrected": 15,
    "<*> torus sender <*> retransmission error(s) (dcr <*>) detected and corrected over <*> seconds": 16,
    "<*> total interrupts. <*> critical input interrupts. <*> microseconds total spent on critical input interrupts, <*> microseconds max time in a critical input interrupt.": 17,
    "<*> tree receiver <*> in re-synch state event(s) (dcr <*>) detected": 18,
    "<*> tree receiver <*> in re-synch state event(s) (dcr <*>) detected over <*> seconds": 19,
    "<*> with VPD of <*>: IBM Part Number: <*>, Vendor: <*>, Vendor Serial Number: <*>, Assembly Revision: <*>, Code Revision: <*>, Manufacture Date: <*>, Manufacture Location: <*> is usable but not a supported version": 20,
    "<*>, max=<*>": 21,
    "Added <*> subnets and <*> addresses to DB": 22,
    "BGLMaster has been started: ./BGLMaster --consoleip <*> --consoleport <*> --configfile <*>": 23,
    "BGLMaster has been started: ./BGLMaster --consoleip <*> --consoleport <*> --configfile <*> --autorestart <*>": 24,
    "BGLMaster has been started: ./BGLMaster --consoleip <*> --consoleport <*> --configfile <*> --autorestart <*> --db2profile <*> --dbproperties <*>": 25,
    "Bad cable going into LinkCard (<*>) Jtag (<*>) Port (<*>) - <*> bad wires": 26,
    "BglIdoChip table has <*> IDOs with the same IP address <*>": 27,
    "CE sym <*>, at <*>, mask <*>": 28,
    "Can not get assembly information for node card": 29,
    "Controlling BG/L rows [ <*> ]": 30,
    "DDR machine check register: <*> <*>": 31,
    "DeclareServiceNetworkCharacteristics has been run but the DB is not empty": 32,
    "DeclareServiceNetworkCharacteristics has been run with the force option but the DB is not empty": 33,
    "EndServiceAction <*> performed upon <*> by <*>": 34,
    "EndServiceAction is restarting the <*> cards in Midplane <*> as part of Service Action <*>": 35,
    "EndServiceAction is restarting the LinkCards in midplane <*> as part of Service Action <*>": 36,
    "EndServiceAction is restarting the NodeCards in midplane <*> as part of Service Action <*>": 37,
    "Error receiving packet on tree network, expecting type <*> instead of type <*> (softheader=<*> <*> <*> <*>) PSR0=<*> PSR1=<*> PRXF=<*> PIXF=<*>": 38,
    "Error sending packet on tree network, packet at address <*> is not aligned": 39,
    "Error: unable to mount filesystem": 40,
    "Floating Point Registers:": 41,
    "Floating Point Status and Control Register: <*>": 42,
    "Found invalid node ecid in processor card slot <*>, ecid <*>": 43,
    "General Purpose Registers:": 44,
    "Ido chip status changed: <*> ip=<*> v=<*> t=<*> status=<*> <*>": 45,
    "Ido packet timeout": 46,
    "Kernel detected <*> integer alignment exceptions (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*>": 47,
    "L1 DCACHE summary averages: #ofDirtyLines: <*> out of <*> #ofDirtyDblWord: <*> out of <*>": 48,
    "L3 correctable errors exceeds threshold (iar <*> lr <*>)": 49,
    "L3 ecc control register: <*>": 50,
    "L3 ecc status register: <*>": 51,
    "L3 global control register: <*>": 52,
    "L3 major internal error": 53,
    "Link PGOOD error latched on link card": 54,
    "LinkCard is not fully functional": 55,
    "LinkCard power module <*> is not accessible": 56,
    "Lustre mount FAILED : <*> : block_id : location": 57,
    "Lustre mount FAILED : <*> : point <*>": 58,
    "MACHINE CHECK DCR read timeout (mc=<*> iar <*> lr <*>)": 59,
    "MACHINE CHECK PLB write IRQ (mc=<*> iar <*> lr <*>)": 60,
    "MailboxMonitor::serviceMailboxes() lib_ido_error: <*> socket closed": 61,
    "Microloader Assertion": 62,
    "MidplaneSwitchController performing bit sparing on <*> bit <*>": 63,
    "MidplaneSwitchController::clearPort() bll_clear_port failed: <*>": 64,
    "MidplaneSwitchController::parityAlignment() pap failed: <*> status=<*>": 65,
    "MidplaneSwitchController::receiveTrain() iap failed: <*>, status=<*>": 66,
    "MidplaneSwitchController::sendTrain() port disconnected: <*>": 67,
    "Missing reverse cable: Cable <*> is present BUT the reverse cable <*> is missing": 68,
    "NFS Mount failed on <*>, slept <*> seconds, retrying (<*>)": 69,
    "New ido chip inserted into the database: <*> ip=<*> v=<*> t=<*>": 70,
    "No power module <*> found found on link card": 71,
    "Node card VPD check: <*> node in processor card slot <*> do not match. VPD ecid <*>, found <*>": 72,
    "Node card VPD check: missing <*>, VPD ecid <*> in processor card slot <*>": 73,
    "Node card is not fully functional": 74,
    "Node card status: <*> is (are) active. Clock Mode is <*>. Clock Select is <*>. Phy JTAG Reset is <*>. ASIC JTAG Reset is <*>. TEMPERATURE MASK IS ACTIVE. No temperature error. Temperature Limit Error Latch is clear. PGOOD is <*>. PGOOD error latch is clear. MPGOOD is <*>. MPGOOD error latch is clear. The <*> volt rail is <*>. The <*> volt rail is <*>.": 75,
    "Node card status: <*> is (are) active. Clock Mode is <*>. Clock Select is <*>. Phy JTAG Reset is <*>. ASIC JTAG Reset is <*>. Temperature Mask is not active. No temperature error. Temperature Limit Error Latch is clear. PGOOD is <*>. PGOOD error latch is clear. MPGOOD is <*>. MPGOOD error latch is clear. The <*> volt rail is <*>. The <*> volt rail is <*>.": 76,
    "Node card status: no ALERTs are active. Clock Mode is <*>. Clock Select is <*>. Phy JTAG Reset is <*>. ASIC JTAG Reset is <*>. Temperature Mask is <*>. No temperature error. Temperature Limit Error Latch is clear. PGOOD IS <*>. PGOOD ERROR LATCH IS <*>. MPGOOD IS <*>. MPGOOD ERROR LATCH IS <*>. The <*> volt rail is <*>. THE <*> VOLT RAIL IS <*>.": 77,
    "NodeCard VPD chip is not accessible": 78,
    "NodeCard VPD is corrupt": 79,
    "NodeCard is not fully functional": 80,
    "NodeCard power module <*> is not accessible": 81,
    "NodeCard temperature sensor chip <*> is not accessible": 82,
    "Power Good signal deactivated: <*>. A service action may be required.": 83,
    "Power deactivated: <*>": 84,
    "PrepareForService is being done on this Midplane (<*>, <*>, <*>) by <*>": 85,
    "PrepareForService shutting down NodeCard(<*>, <*>, <*>, <*>, <*>) as part of Service Action <*>": 86,
    "Problem communicating with service card, ido chip: <*>. java.io.IOException: Could not find EthernetSwitch on port:address <*>": 87,
    "Problem reading the ethernet arl entries fro the service card: <*>: while executing I2C Operation caught <*>: Communication error: (<*> is in state = <*>, sequenceNumberIsOk = <*>, ExpectedSequenceNumber = <*>, Reply Sequence Number = <*>, timedOut = <*>, retries = <*>, timeout = <*>, Expected Op Command = <*>, Actual Op Reply = <*>, Expected Sync Command = <*>, Actual Sync Reply = <*>)": 88,
    "Running as background command": 89,
    "SerialNumber(<*>) IpAddress(<*>) Status(<*>)": 90,
    "Special Purpose Registers:": 91,
    "Starting SystemController": 92,
    "Target=<*> Message=<*>": 93,
    "Target=<*> Message=<*> JtagId = <*>": 94,
    "Temperature Over Limit on link card": 95,
    "Torus non-recoverable error DCRs follow.": 96,
    "address parity error..<*>": 97,
    "auxiliary processor.........................<*>": 98,
    "ax=<*>": 99,
    "byte ordering exception.....................<*>": 100,
    "capture valid.........<*>": 101,
    "chip select...........<*>": 102,
    "ciod: <*> coordinate <*> exceeds physical dimension <*> at line <*> of node map file <*>": 103,
    "ciod: Error creating node map from file <*>: Argument list too long": 104,
    "ciod: Error creating node map from file <*>: Bad file descriptor": 105,
    "ciod: Error creating node map from file <*>: Block device required": 106,
    "ciod: Error creating node map from file <*>: Device or resource busy": 107,
    "ciod: Error creating node map from file <*>: No child processes": 108,
    "ciod: Error creating node map from file <*>: No such file or directory": 109,
    "ciod: Error creating node map from file <*>: Permission denied": 110,
    "ciod: Error loading <*>: invalid or missing program image, Exec format error": 111,
    "ciod: Error loading <*>: invalid or missing program image, No such file or directory": 112,
    "ciod: Error loading <*>: invalid or missing program image, Permission denied": 113,
    "ciod: Error loading <*>: program image too big, <*> > <*>": 114,
    "ciod: Error reading message prefix after LOAD_MESSAGE on CioStream socket to <*>: Link has been severed": 115,
    "ciod: Error reading message prefix on CioStream socket to <*>, Connection reset by peer": 116,
    "ciod: Error reading message prefix on CioStream socket to <*>, Connection timed out": 117,
    "ciod: Error reading message prefix on CioStream socket to <*>, Link has been severed": 118,
    "ciod: In packet from node <*> (<*>), message code <*> is not <*> or <*> (softheader=<*>)": 119,
    "ciod: LOGIN chdir(<*>) failed: Input/output error": 120,
    "ciod: LOGIN chdir(<*>) failed: No such file or directory": 121,
    "ciod: LOGIN chdir(<*>) failed: Permission denied": 122,
    "ciod: Message code <*> is not <*> or <*>": 123,
    "ciod: Missing or invalid fields on line <*> of node map file <*>": 124,
    "ciod: Received signal <*>, code=<*>, errno=<*>, address=<*>": 125,
    "ciod: Unexpected eof at line <*> of node map file <*>": 126,
    "ciod: cpu <*> at treeaddr <*> sent unrecognized message <*>": 127,
    "ciod: duplicate canonical-rank <*> to logical-rank <*> mapping at line <*> of node map file <*>": 128,
    "ciod: for node <*> read continuation request but ioState is <*>": 129,
    "ciod: for node <*>, incomplete data written to core file core.<*>": 130,
    "ciod: generated <*> core files for program <*>": 131,
    "ciod: pollControlDescriptors: Detected the debugger died.": 132,
    "ciodb exited abnormally due to signal: <*>": 133,
    "ciodb exited normally with exit code <*>": 134,
    "ciodb has been restarted.": 135,
    "close EDRAM pages as soon as possible....<*>": 136,
    "command manager unit summary.....................<*>": 137,
    "core configuration register: <*>": 138,
    "correctable error detected in EDRAM bank <*>": 139,
    "correctable error detected in directory <*>": 140,
    "correctable error.....<*>": 141,
    "critical input interrupt (unit=<*> bit=<*>): warning for torus <*> wire": 142,
    "critical input interrupt (unit=<*> bit=<*>): warning for torus <*> wire, suppressing further interrupts of same type": 143,
    "critical input interrupt (unit=<*> bit=<*>): warning for tree <*> wire": 144,
    "critical input interrupt (unit=<*> bit=<*>): warning for tree <*> wire, suppressing further interrupts of same type": 145,
    "critical input interrupt enable...<*>": 146,
    "d-cache flush parity error.......<*>": 147,
    "d-cache search parity error.......<*>": 148,
    "data TLB error interrupt": 149,
    "data address space................<*>": 150,
    "data cache flush parity error detected. attempting to correct": 151,
    "data cache search parity error detected. attempting to correct": 152,
    "data read plb error...............<*>": 153,
    "data storage interrupt": 154,
    "data store interrupt caused by dcbf.........<*>": 155,
    "data store interrupt caused by icbi.........<*>": 156,
    "data write plb error..............<*>": 157,
    "dbcr0=<*> dbsr=<*> ccr0=<*>": 158,
    "ddr: Unable to steer rank=<*>, symbol=<*> - rank is already steering symbol <*>. Due to multiple symbols being over the correctable": 159,
    "ddr: Unable to steer rank=<*>, symbol=<*> - rank is already steering symbol <*>. Due to multiple symbols being over the correctable error threshold, consider replacing the card": 160,
    "ddr: activating redundant bit steering for next allocation: rank=<*> symbol=<*>": 161,
    "ddr: activating redundant bit steering: rank=<*> symbol=<*>": 162,
    "ddr: excessive soft failures, consider replacing the card": 163,
    "dear <*> (<*> RAS KERNEL INFO Kernel detected <*> integer alignment exceptions (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*>": 164,
    "debug interrupt enable............<*>": 165,
    "debug wait enable.................<*>": 166,
    "disable all access to cache directory....<*>": 167,
    "disable apu instruction broadcast........<*>": 168,
    "disable flagging of DDR UE's as major internal error.<*>": 169,
    "disable speculative access...............<*>": 170,
    "disable store gathering..................<*>": 171,
    "disable trace broadcast..................<*>": 172,
    "disable write lines <*>..................<*>": 173,
    "divide-by-zero exception.................<*>": 174,
    "enable divide-by-zero exceptions.........<*>": 175,
    "enable inexact exceptions................<*>": 176,
    "enable invalid operation exceptions......<*>": 177,
    "enable non-IEEE mode.....................<*>": 178,
    "enable overflow exceptions...............<*>": 179,
    "enable underflow exceptions..............<*>": 180,
    "enabled exception summary................<*>": 181,
    "error threshold, consider replacing the card": 182,
    "exception summary........................<*>": 183,
    "exception syndrome register: <*>": 184,
    "external input interrupt (unit=<*> bit=<*>): 1M tree receiver <*> in resynch mode": 185,
    "external input interrupt (unit=<*> bit=<*>): number of corrected SRAM errors has exceeded threshold": 186,
    "external input interrupt (unit=<*> bit=<*>): number of corrected SRAM errors has exceeded threshold, suppressing further interrupts of same type": 187,
    "external input interrupt (unit=<*> bit=<*>): torus sender <*> retransmission error was corrected": 188,
    "external input interrupt (unit=<*> bit=<*>): tree header with no target waiting": 189,
    "external input interrupt (unit=<*> bit=<*>): uncorrectable torus error": 190,
    "external input interrupt enable...<*>": 191,
    "floating point instr. enabled.....<*>": 192,
    "floating point operation....................<*>": 193,
    "floating pt ex mode <*> enable......<*>": 194,
    "force load/store alignment...............<*>": 195,
    "fraction inexact.........................<*>": 196,
    "fraction rounded.........................<*>": 197,
    "general purpose registers:": 198,
    "generating core.<*>": 199,
    "guaranteed data cache block touch........<*>": 200,
    "guaranteed instruction cache block touch.<*>": 201,
    "i-cache parity error..............<*>": 202,
    "iar <*> dear <*>": 203,
    "icache prefetch depth....................<*>": 204,
    "idoproxy communication failure: socket closed": 205,
    "idoproxy exited normally with exit code <*>": 206,
    "idoproxydb has been started: $Name: <*> $ Input parameters: <*>": 207,
    "idoproxydb hit ASSERT condition: ASSERT expression=<*> Source file=<*> Source line=<*> Function=<*>": 208,
    "imprecise machine check...........<*>": 209,
    "inexact exception........................<*>": 210,
    "instance of a correctable ddr. RAS KERNEL INFO <*> microseconds spent in the rbs signal handler during <*> calls. <*> microseconds was the maximum time for a single instance of a correctable ddr.": 211,
    "instruction address space.........<*>": 212,
    "instruction address: <*>": 213,
    "instruction cache parity error corrected": 214,
    "instruction plb error.............<*>": 215,
    "interrupt threshold...<*>": 216,
    "invalid (<*>)........................<*>": 217,
    "invalid operation exception (int cnvt)...<*>": 218,
    "invalid operation exception (software)...<*>": 219,
    "invalid operation exception (sqrt).......<*>": 220,
    "invalid operation exception summary......<*>": 221,
    "job <*> timed out. Block freed.": 222,
    "kernel panic": 223,
    "lr:<*> cr:<*> xer:<*> ctr:<*>": 224,
    "machine check enable..............<*>": 225,
    "machine check interrupt": 226,
    "machine check interrupt (bit=<*>): L2 DCU read error": 227,
    "machine check interrupt (bit=<*>): L2 dcache unit read return parity error": 228,
    "machine check interrupt (bit=<*>): L3 major internal error": 229,
    "machine check interrupt (bit=<*>): Torus/Tree/GI read error <*>": 230,
    "machine check status register: <*>": 231,
    "machine check: i-fetch......................<*>": 232,
    "machine state register: <*>": 233,
    "mask..................<*>": 234,
    "max number of outstanding prefetches.....<*>": 235,
    "max time in a cr RAS KERNEL INFO <*> total interrupts. <*> critical input interrupts. <*> microseconds total spent on critical input interrupts, <*> microseconds max time in a critical input interrupt.": 236,
    "memory and bus summary...........................<*>": 237,
    "memory manager / command manager address parity..<*>": 238,
    "memory manager RMW buffer parity.................<*>": 239,
    "memory manager address error.....................<*>": 240,
    "memory manager address parity error..............<*>": 241,
    "memory manager miscompare........................<*>": 242,
    "memory manager refresh contention................<*>": 243,
    "memory manager refresh counter timeout...........<*>": 244,
    "memory manager store buffer parity...............<*>": 245,
    "memory manager strobe gate.......................<*>": 246,
    "memory manager uncorrectable error...............<*>": 247,
    "minus denormalized number................<*>": 248,
    "minus inf................................<*>": 249,
    "minus normalized number..................<*>": 250,
    "miscompare............<*>": 251,
    "mmcs_db_server has been started: ./mmcs_db_server --useDatabase <*> --dbproperties <*> --iolog <*> --reconnect-blocks <*> --shutdown-timeout <*>": 252,
    "monitor caught <*>: while executing <*> caught <*>: Broken pipe and is stopping": 253,
    "msr=<*> dear=<*> esr=<*> fpscr=<*>": 254,
    "no ethernet link": 255,
    "number of correctable errors detected in L3 EDRAMs........<*>": 256,
    "number of correctable errors detected in L3 directories...<*>": 257,
    "number of lines with parity errors written to L3 EDRAMs...<*>": 258,
    "parity error in bank <*>.........................<*>": 259,
    "parity error in read queue <*>...................<*>": 260,
    "parity error.......<*>": 261,
    "plus denormalized number.................<*>": 262,
    "plus infinity............................<*>": 263,
    "plus normalized number...................<*>": 264,
    "plus zero................................<*>": 265,
    "power module status fault detected on node card. status registers are: <*>": 266,
    "prefetch depth for core <*>................<*>": 267,
    "problem state (<*>=sup,<*>=usr).......<*>": 268,
    "program": 269,
    "program interrupt": 270,
    "program interrupt: fp compare...............<*>": 271,
    "program interrupt: fp cr field .............<*>": 272,
    "program interrupt: fp cr update.............<*>": 273,
    "program interrupt: illegal instruction......<*>": 274,
    "program interrupt: imprecise exception......<*>": 275,
    "program interrupt: privileged instruction...<*>": 276,
    "program interrupt: trap instruction.........<*>": 277,
    "program interrupt: unimplemented operation..<*>": 278,
    "quiet <*>................................<*>": 279,
    "qw trapped............<*>": 280,
    "regctl scancom interface.........................<*>": 281,
    "reserved.................................<*>": 282,
    "round nearest............................<*>": 283,
    "round toward +infinity...................<*>": 284,
    "round toward -infinity...................<*>": 285,
    "round toward zero...................<*>": 286,
    "rror threshold, consider replacing the card": 287,
    "rts internal error": 288,
    "rts panic! - stopping execution": 289,
    "rts tree/torus link training failed: wanted: <*> got: <*>": 290,
    "rts: bad message header: cpu <*> invalid (softheader=<*>) PSR0=<*> PSR1=<*> PRXF=<*> PIXF=<*>": 291,
    "rts: bad message header: expecting type <*> instead of type <*> (softheader=<*>) PSR0=<*> PSR1=<*> PRXF=<*> PIXF=<*>": 292,
    "rts: bad message header: index <*> greater than total <*> (softheader=<*>) PSR0=<*> PSR1=<*> PRXF=<*> PIXF=<*>": 293,
    "rts: kernel terminated for reason <*>": 294,
    "shutdown complete": 295,
    "size of DDR we are caching...............<*> (<*>)": 296,
    "size of scratchpad portion of L3.........<*> (<*>)": 297,
    "special purpose registers:": 298,
    "start flushing...........................<*>": 299,
    "start initialization.....................<*>": 300,
    "start prefetching........................<*>": 301,
    "start retagging..........................<*>": 302,
    "state machine....................................<*>": 303,
    "store operation.............................<*>": 304,
    "summary...........................<*>": 305,
    "suppressing further interrupts of same type": 306,
    "symbol................<*>": 307,
    "this link card is not fully functional": 308,
    "tlb error.........................<*>": 309,
    "total of <*> ddr error(s) detected and corrected": 310,
    "total of <*> ddr error(s) detected and corrected over <*> seconds": 311,
    "turn on hidden refreshes.................<*>": 312,
    "uncorrectable error detected in EDRAM bank <*>...<*>": 313,
    "uncorrectable error detected in directory <*>....<*>": 314,
    "uncorrectable error detected in external DDR...<*>": 315,
    "underflow exception......................<*>": 316,
    "wait state enable.................<*>": 317,
    "write buffer commit threshold............<*>": 318,
    "x=<*>": 319,
    "<PAD>": 320,
    "<UNK>": 321
  },
  "id_to_template": {
    "0": "<*> L3 <*> error(s) (dcr <*>) detected and corrected",
    "1": "<*> L3 <*> error(s) (dcr <*>) detected and corrected over <*> seconds",
    "2": "<*> ddr error(s) detected and corrected on rank <*>, symbol <*> over <*> seconds",
    "3": "<*> ddr errors(s) detected and corrected on rank <*>, symbol <*> bit <*>",
    "4": "<*> double-hummer alignment exceptions",
    "5": "<*> floating point alignment exceptions",
    "6": "<*> microseconds spent in the rbs signal handler during <*> calls. <*> microseconds was the maximum time for a single instance of a correctable ddr.",
    "7": "<*> torus non-crc error(s) (dcr <*>) detected and corrected",
    "8": "<*> torus non-crc error(s) (dcr <*>) detected and corrected over <*> seconds",
    "9": "<*> torus processor sram injection error(s) (dcr <*>) detected and corrected over <*> seconds",
    "10": "<*> torus processor sram reception error(s) (dcr <*>) detected and corrected",
    "11": "<*> torus receiver <*> input pipe error(s) (dcr <*>) detected and corrected",
    "12": "<*> torus receiver <*> input pipe error(s) (dcr <*>) detected and corrected over <*> seconds",
    "13": "<*> torus receiver sram ecc error(s) (dcr <*>) detected and corrected",
    "14": "<*> torus receiver sram ecc error(s) (dcr <*>) detected and corrected over <*> seconds",
    "15": "<*> torus sender <*> retransmission error(s) (dcr <*>) detected and corrected",
    "16": "<*> torus sender <*> retransmission error(s) (dcr <*>) detected and corrected over <*> seconds",
    "17": "<*> total interrupts. <*> critical input interrupts. <*> microseconds total spent on critical input interrupts, <*> microseconds max time in a critical input interrupt.",
    "18": "<*> tree receiver <*> in re-synch state event(s) (dcr <*>) detected",
    "19": "<*> tree receiver <*> in re-synch state event(s) (dcr <*>) detected over <*> seconds",
    "20": "<*> with VPD of <*>: IBM Part Number: <*>, Vendor: <*>, Vendor Serial Number: <*>, Assembly Revision: <*>, Code Revision: <*>, Manufacture Date: <*>, Manufacture Location: <*> is usable but not a supported version",
    "21": "<*>, max=<*>",
    "22": "Added <*> subnets and <*> addresses to DB",
    "23": "BGLMaster has been started: ./BGLMaster --consoleip <*> --consoleport <*> --configfile <*>",
    "24": "BGLMaster has been started: ./BGLMaster --consoleip <*> --consoleport <*> --configfile <*> --autorestart <*>",
    "25": "BGLMaster has been started: ./BGLMaster --consoleip <*> --consoleport <*> --configfile <*> --autorestart <*> --db2profile <*> --dbproperties <*>",
    "26": "Bad cable going into LinkCard (<*>) Jtag (<*>) Port (<*>) - <*> bad wires",
    "27": "BglIdoChip table has <*> IDOs with the same IP address <*>",
    "28": "CE sym <*>, at <*>, mask <*>",
    "29": "Can not get assembly information for node card",
    "30": "Controlling BG/L rows [ <*> ]",
    "31": "DDR machine check register: <*> <*>",
    "32": "DeclareServiceNetworkCharacteristics has been run but the DB is not empty",
    "33": "DeclareServiceNetworkCharacteristics has been run with the force option but the DB is not empty",
    "34": "EndServiceAction <*> performed upon <*> by <*>",
    "35": "EndServiceAction is restarting the <*> cards in Midplane <*> as part of Service Action <*>",
    "36": "EndServiceAction is restarting the LinkCards in midplane <*> as part of Service Action <*>",
    "37": "EndServiceAction is restarting the NodeCards in midplane <*> as part of Service Action <*>",
    "38": "Error receiving packet on tree network, expecting type <*> instead of type <*> (softheader=<*> <*> <*> <*>) PSR0=<*> PSR1=<*> PRXF=<*> PIXF=<*>",
    "39": "Error sending packet on tree network, packet at address <*> is not aligned",
    "40": "Error: unable to mount filesystem",
    "41": "Floating Point Registers:",
    "42": "Floating Point Status and Control Register: <*>",
    "43": "Found invalid node ecid in processor card slot <*>, ecid <*>",
    "44": "General Purpose Registers:",
    "45": "Ido chip status changed: <*> ip=<*> v=<*> t=<*> status=<*> <*>",
    "46": "Ido packet timeout",
    "47": "Kernel detected <*> integer alignment exceptions (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*>",
    "48": "L1 DCACHE summary averages: #ofDirtyLines: <*> out of <*> #ofDirtyDblWord: <*> out of <*>",
    "49": "L3 correctable errors exceeds threshold (iar <*> lr <*>)",
    "50": "L3 ecc control register: <*>",
    "51": "L3 ecc status register: <*>",
    "52": "L3 global control register: <*>",
    "53": "L3 major internal error",
    "54": "Link PGOOD error latched on link card",
    "55": "LinkCard is not fully functional",
    "56": "LinkCard power module <*> is not accessible",
    "57": "Lustre mount FAILED : <*> : block_id : location",
    "58": "Lustre mount FAILED : <*> : point <*>",
    "59": "MACHINE CHECK DCR read timeout (mc=<*> iar <*> lr <*>)",
    "60": "MACHINE CHECK PLB write IRQ (mc=<*> iar <*> lr <*>)",
    "61": "MailboxMonitor::serviceMailboxes() lib_ido_error: <*> socket closed",
    "62": "Microloader Assertion",
    "63": "MidplaneSwitchController performing bit sparing on <*> bit <*>",
    "64": "MidplaneSwitchController::clearPort() bll_clear_port failed: <*>",
    "65": "MidplaneSwitchController::parityAlignment() pap failed: <*> status=<*>",
    "66": "MidplaneSwitchController::receiveTrain() iap failed: <*>, status=<*>",
    "67": "MidplaneSwitchController::sendTrain() port disconnected: <*>",
    "68": "Missing reverse cable: Cable <*> is present BUT the reverse cable <*> is missing",
    "69": "NFS Mount failed on <*>, slept <*> seconds, retrying (<*>)",
    "70": "New ido chip inserted into the database: <*> ip=<*> v=<*> t=<*>",
    "71": "No power module <*> found found on link card",
    "72": "Node card VPD check: <*> node in processor card slot <*> do not match. VPD ecid <*>, found <*>",
    "73": "Node card VPD check: missing <*>, VPD ecid <*> in processor card slot <*>",
    "74": "Node card is not fully functional",
    "75": "Node card status: <*> is (are) active. Clock Mode is <*>. Clock Select is <*>. Phy JTAG Reset is <*>. ASIC JTAG Reset is <*>. TEMPERATURE MASK IS ACTIVE. No temperature error. Temperature Limit Error Latch is clear. PGOOD is <*>. PGOOD error latch is clear. MPGOOD is <*>. MPGOOD error latch is clear. The <*> volt rail is <*>. The <*> volt rail is <*>.",
    "76": "Node card status: <*> is (are) active. Clock Mode is <*>. Clock Select is <*>. Phy JTAG Reset is <*>. ASIC JTAG Reset is <*>. Temperature Mask is not active. No temperature error. Temperature Limit Error Latch is clear. PGOOD is <*>. PGOOD error latch is clear. MPGOOD is <*>. MPGOOD error latch is clear. The <*> volt rail is <*>. The <*> volt rail is <*>.",
    "77": "Node card status: no ALERTs are active. Clock Mode is <*>. Clock Select is <*>. Phy JTAG Reset is <*>. ASIC JTAG Reset is <*>. Temperature Mask is <*>. No temperature error. Temperature Limit Error Latch is clear. PGOOD IS <*>. PGOOD ERROR LATCH IS <*>. MPGOOD IS <*>. MPGOOD ERROR LATCH IS <*>. The <*> volt rail is <*>. THE <*> VOLT RAIL IS <*>.",
    "78": "NodeCard VPD chip is not accessible",
    "79": "NodeCard VPD is corrupt",
    "80": "NodeCard is not fully functional",
    "81": "NodeCard power module <*> is not accessible",
    "82": "NodeCard temperature sensor chip <*> is not accessible",
    "83": "Power Good signal deactivated: <*>. A service action may be required.",
    "84": "Power deactivated: <*>",
    "85": "PrepareForService is being done on this Midplane (<*>, <*>, <*>) by <*>",
    "86": "PrepareForService shutting down NodeCard(<*>, <*>, <*>, <*>, <*>) as part of Service Action <*>",
    "87": "Problem communicating with service card, ido chip: <*>. java.io.IOException: Could not find EthernetSwitch on port:address <*>",
    "88": "Problem reading the ethernet arl entries fro the service card: <*>: while executing I2C Operation caught <*>: Communication error: (<*> is in state = <*>, sequenceNumberIsOk = <*>, ExpectedSequenceNumber = <*>, Reply Sequence Number = <*>, timedOut = <*>, retries = <*>, timeout = <*>, Expected Op Command = <*>, Actual Op Reply = <*>, Expected Sync Command = <*>, Actual Sync Reply = <*>)",
    "89": "Running as background command",
    "90": "SerialNumber(<*>) IpAddress(<*>) Status(<*>)",
    "91": "Special Purpose Registers:",
    "92": "Starting SystemController",
    "93": "Target=<*> Message=<*>",
    "94": "Target=<*> Message=<*> JtagId = <*>",
    "95": "Temperature Over Limit on link card",
    "96": "Torus non-recoverable error DCRs follow.",
    "97": "address parity error..<*>",
    "98": "auxiliary processor.........................<*>",
    "99": "ax=<*>",
    "100": "byte ordering exception.....................<*>",
    "101": "capture valid.........<*>",
    "102": "chip select...........<*>",
    "103": "ciod: <*> coordinate <*> exceeds physical dimension <*> at line <*> of node map file <*>",
    "104": "ciod: Error creating node map from file <*>: Argument list too long",
    "105": "ciod: Error creating node map from file <*>: Bad file descriptor",
    "106": "ciod: Error creating node map from file <*>: Block device required",
    "107": "ciod: Error creating node map from file <*>: Device or resource busy",
    "108": "ciod: Error creating node map from file <*>: No child processes",
    "109": "ciod: Error creating node map from file <*>: No such file or directory",
    "110": "ciod: Error creating node map from file <*>: Permission denied",
    "111": "ciod: Error loading <*>: invalid or missing program image, Exec format error",
    "112": "ciod: Error loading <*>: invalid or missing program image, No such file or directory",
    "113": "ciod: Error loading <*>: invalid or missing program image, Permission denied",
    "114": "ciod: Error loading <*>: program image too big, <*> > <*>",
    "115": "ciod: Error reading message prefix after LOAD_MESSAGE on CioStream socket to <*>: Link has been severed",
    "116": "ciod: Error reading message prefix on CioStream socket to <*>, Connection reset by peer",
    "117": "ciod: Error reading message prefix on CioStream socket to <*>, Connection timed out",
    "118": "ciod: Error reading message prefix on CioStream socket to <*>, Link has been severed",
    "119": "ciod: In packet from node <*> (<*>), message code <*> is not <*> or <*> (softheader=<*>)",
    "120": "ciod: LOGIN chdir(<*>) failed: Input/output error",
    "121": "ciod: LOGIN chdir(<*>) failed: No such file or directory",
    "122": "ciod: LOGIN chdir(<*>) failed: Permission denied",
    "123": "ciod: Message code <*> is not <*> or <*>",
    "124": "ciod: Missing or invalid fields on line <*> of node map file <*>",
    "125": "ciod: Received signal <*>, code=<*>, errno=<*>, address=<*>",
    "126": "ciod: Unexpected eof at line <*> of node map file <*>",
    "127": "ciod: cpu <*> at treeaddr <*> sent unrecognized message <*>",
    "128": "ciod: duplicate canonical-rank <*> to logical-rank <*> mapping at line <*> of node map file <*>",
    "129": "ciod: for node <*> read continuation request but ioState is <*>",
    "130": "ciod: for node <*>, incomplete data written to core file core.<*>",
    "131": "ciod: generated <*> core files for program <*>",
    "132": "ciod: pollControlDescriptors: Detected the debugger died.",
    "133": "ciodb exited abnormally due to signal: <*>",
    "134": "ciodb exited normally with exit code <*>",
    "135": "ciodb has been restarted.",
    "136": "close EDRAM pages as soon as possible....<*>",
    "137": "command manager unit summary.....................<*>",
    "138": "core configuration register: <*>",
    "139": "correctable error detected in EDRAM bank <*>",
    "140": "correctable error detected in directory <*>",
    "141": "correctable error.....<*>",
    "142": "critical input interrupt (unit=<*> bit=<*>): warning for torus <*> wire",
    "143": "critical input interrupt (unit=<*> bit=<*>): warning for torus <*> wire, suppressing further interrupts of same type",
    "144": "critical input interrupt (unit=<*> bit=<*>): warning for tree <*> wire",
    "145": "critical input interrupt (unit=<*> bit=<*>): warning for tree <*> wire, suppressing further interrupts of same type",
    "146": "critical input interrupt enable...<*>",
    "147": "d-cache flush parity error.......<*>",
    "148": "d-cache search parity error.......<*>",
    "149": "data TLB error interrupt",
    "150": "data address space................<*>",
    "151": "data cache flush parity error detected. attempting to correct",
    "152": "data cache search parity error detected. attempting to correct",
    "153": "data read plb error...............<*>",
    "154": "data storage interrupt",
    "155": "data store interrupt caused by dcbf.........<*>",
    "156": "data store interrupt caused by icbi.........<*>",
    "157": "data write plb error..............<*>",
    "158": "dbcr0=<*> dbsr=<*> ccr0=<*>",
    "159": "ddr: Unable to steer rank=<*>, symbol=<*> - rank is already steering symbol <*>. Due to multiple symbols being over the correctable",
    "160": "ddr: Unable to steer rank=<*>, symbol=<*> - rank is already steering symbol <*>. Due to multiple symbols being over the correctable error threshold, consider replacing the card",
    "161": "ddr: activating redundant bit steering for next allocation: rank=<*> symbol=<*>",
    "162": "ddr: activating redundant bit steering: rank=<*> symbol=<*>",
    "163": "ddr: excessive soft failures, consider replacing the card",
    "164": "dear <*> (<*> RAS KERNEL INFO Kernel detected <*> integer alignment exceptions (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*> (<*>) iar <*>, dear <*>",
    "165": "debug interrupt enable............<*>",
    "166": "debug wait enable.................<*>",
    "167": "disable all access to cache directory....<*>",
    "168": "disable apu instruction broadcast........<*>",
    "169": "disable flagging of DDR UE's as major internal error.<*>",
    "170": "disable speculative access...............<*>",
    "171": "disable store gathering..................<*>",
    "172": "disable trace broadcast..................<*>",
    "173": "disable write lines <*>..................<*>",
    "174": "divide-by-zero exception.................<*>",
    "175": "enable divide-by-zero exceptions.........<*>",
    "176": "enable inexact exceptions................<*>",
    "177": "enable invalid operation exceptions......<*>",
    "178": "enable non-IEEE mode.....................<*>",
    "179": "enable overflow exceptions...............<*>",
    "180": "enable underflow exceptions..............<*>",
    "181": "enabled exception summary................<*>",
    "182": "error threshold, consider replacing the card",
    "183": "exception summary........................<*>",
    "184": "exception syndrome register: <*>",
    "185": "external input interrupt (unit=<*> bit=<*>): 1M tree receiver <*> in resynch mode",
    "186": "external input interrupt (unit=<*> bit=<*>): number of corrected SRAM errors has exceeded threshold",
    "187": "external input interrupt (unit=<*> bit=<*>): number of corrected SRAM errors has exceeded threshold, suppressing further interrupts of same type",
    "188": "external input interrupt (unit=<*> bit=<*>): torus sender <*> retransmission error was corrected",
    "189": "external input interrupt (unit=<*> bit=<*>): tree header with no target waiting",
    "190": "external input interrupt (unit=<*> bit=<*>): uncorrectable torus error",
    "191": "external input interrupt enable...<*>",
    "192": "floating point instr. enabled.....<*>",
    "193": "floating point operation....................<*>",
    "194": "floating pt ex mode <*> enable......<*>",
    "195": "force load/store alignment...............<*>",
    "196": "fraction inexact.........................<*>",
    "197": "fraction rounded.........................<*>",
    "198": "general purpose registers:",
    "199": "generating core.<*>",
    "200": "guaranteed data cache block touch........<*>",
    "201": "guaranteed instruction cache block touch.<*>",
    "202": "i-cache parity error..............<*>",
    "203": "iar <*> dear <*>",
    "204": "icache prefetch depth....................<*>",
    "205": "idoproxy communication failure: socket closed",
    "206": "idoproxy exited normally with exit code <*>",
    "207": "idoproxydb has been started: $Name: <*> $ Input parameters: <*>",
    "208": "idoproxydb hit ASSERT condition: ASSERT expression=<*> Source file=<*> Source line=<*> Function=<*>",
    "209": "imprecise machine check...........<*>",
    "210": "inexact exception........................<*>",
    "211": "instance of a correctable ddr. RAS KERNEL INFO <*> microseconds spent in the rbs signal handler during <*> calls. <*> microseconds was the maximum time for a single instance of a correctable ddr.",
    "212": "instruction address space.........<*>",
    "213": "instruction address: <*>",
    "214": "instruction cache parity error corrected",
    "215": "instruction plb error.............<*>",
    "216": "interrupt threshold...<*>",
    "217": "invalid (<*>)........................<*>",
    "218": "invalid operation exception (int cnvt)...<*>",
    "219": "invalid operation exception (software)...<*>",
    "220": "invalid operation exception (sqrt).......<*>",
    "221": "invalid operation exception summary......<*>",
    "222": "job <*> timed out. Block freed.",
    "223": "kernel panic",
    "224": "lr:<*> cr:<*> xer:<*> ctr:<*>",
    "225": "machine check enable..............<*>",
    "226": "machine check interrupt",
    "227": "machine check interrupt (bit=<*>): L2 DCU read error",
    "228": "machine check interrupt (bit=<*>): L2 dcache unit read return parity error",
    "229": "machine check interrupt (bit=<*>): L3 major internal error",
    "230": "machine check interrupt (bit=<*>): Torus/Tree/GI read error <*>",
    "231": "machine check status register: <*>",
    "232": "machine check: i-fetch......................<*>",
    "233": "machine state register: <*>",
    "234": "mask..................<*>",
    "235": "max number of outstanding prefetches.....<*>",
    "236": "max time in a cr RAS KERNEL INFO <*> total interrupts. <*> critical input interrupts. <*> microseconds total spent on critical input interrupts, <*> microseconds max time in a critical input interrupt.",
    "237": "memory and bus summary...........................<*>",
    "238": "memory manager / command manager address parity..<*>",
    "239": "memory manager RMW buffer parity.................<*>",
    "240": "memory manager address error.....................<*>",
    "241": "memory manager address parity error..............<*>",
    "242": "memory manager miscompare........................<*>",
    "243": "memory manager refresh contention................<*>",
    "244": "memory manager refresh counter timeout...........<*>",
    "245": "memory manager store buffer parity...............<*>",
    "246": "memory manager strobe gate.......................<*>",
    "247": "memory manager uncorrectable error...............<*>",
    "248": "minus denormalized number................<*>",
    "249": "minus inf................................<*>",
    "250": "minus normalized number..................<*>",
    "251": "miscompare............<*>",
    "252": "mmcs_db_server has been started: ./mmcs_db_server --useDatabase <*> --dbproperties <*> --iolog <*> --reconnect-blocks <*> --shutdown-timeout <*>",
    "253": "monitor caught <*>: while executing <*> caught <*>: Broken pipe and is stopping",
    "254": "msr=<*> dear=<*> esr=<*> fpscr=<*>",
    "255": "no ethernet link",
    "256": "number of correctable errors detected in L3 EDRAMs........<*>",
    "257": "number of correctable errors detected in L3 directories...<*>",
    "258": "number of lines with parity errors written to L3 EDRAMs...<*>",
    "259": "parity error in bank <*>.........................<*>",
    "260": "parity error in read queue <*>...................<*>",
    "261": "parity error.......<*>",
    "262": "plus denormalized number.................<*>",
    "263": "plus infinity............................<*>",
    "264": "plus normalized number...................<*>",
    "265": "plus zero................................<*>",
    "266": "power module status fault detected on node card. status registers are: <*>",
    "267": "prefetch depth for core <*>................<*>",
    "268": "problem state (<*>=sup,<*>=usr).......<*>",
    "269": "program",
    "270": "program interrupt",
    "271": "program interrupt: fp compare...............<*>",
    "272": "program interrupt: fp cr field .............<*>",
    "273": "program interrupt: fp cr update.............<*>",
    "274": "program interrupt: illegal instruction......<*>",
    "275": "program interrupt: imprecise exception......<*>",
    "276": "program interrupt: privileged instruction...<*>",
    "277": "program interrupt: trap instruction.........<*>",
    "278": "program interrupt: unimplemented operation..<*>",
    "279": "quiet <*>................................<*>",
    "280": "qw trapped............<*>",
    "281": "regctl scancom interface.........................<*>",
    "282": "reserved.................................<*>",
    "283": "round nearest............................<*>",
    "284": "round toward +infinity...................<*>",
    "285": "round toward -infinity...................<*>",
    "286": "round toward zero...................<*>",
    "287": "rror threshold, consider replacing the card",
    "288": "rts internal error",
    "289": "rts panic! - stopping execution",
    "290": "rts tree/torus link training failed: wanted: <*> got: <*>",
    "291": "rts: bad message header: cpu <*> invalid (softheader=<*>) PSR0=<*> PSR1=<*> PRXF=<*> PIXF=<*>",
    "292": "rts: bad message header: expecting type <*> instead of type <*> (softheader=<*>) PSR0=<*> PSR1=<*> PRXF=<*> PIXF=<*>",
    "293": "rts: bad message header: index <*> greater than total <*> (softheader=<*>) PSR0=<*> PSR1=<*> PRXF=<*> PIXF=<*>",
    "294": "rts: kernel terminated for reason <*>",
    "295": "shutdown complete",
    "296": "size of DDR we are caching...............<*> (<*>)",
    "297": "size of scratchpad portion of L3.........<*> (<*>)",
    "298": "special purpose registers:",
    "299": "start flushing...........................<*>",
    "300": "start initialization.....................<*>",
    "301": "start prefetching........................<*>",
    "302": "start retagging..........................<*>",
    "303": "state machine....................................<*>",
    "304": "store operation.............................<*>",
    "305": "summary...........................<*>",
    "306": "suppressing further interrupts of same type",
    "307": "symbol................<*>",
    "308": "this link card is not fully functional",
    "309": "tlb error.........................<*>",
    "310": "total of <*> ddr error(s) detected and corrected",
    "311": "total of <*> ddr error(s) detected and corrected over <*> seconds",
    "312": "turn on hidden refreshes.................<*>",
    "313": "uncorrectable error detected in EDRAM bank <*>...<*>",
    "314": "uncorrectable error detected in directory <*>....<*>",
    "315": "uncorrectable error detected in external DDR...<*>",
    "316": "underflow exception......................<*>",
    "317": "wait state enable.................<*>",
    "318": "write buffer commit threshold............<*>",
    "319": "x=<*>",
    "320": "<PAD>",
    "321": "<UNK>"
  },
  "vocab_size": 322,
  "num_real_templates": 320
}